src/DemoApp/src/Catalogs/Банки/Банки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Банки</name>
  <attributes>
    <name>БИК</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Реквизит</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>SWIFT</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>11</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Страна</name>
    <type>
      <types>CatalogRef.Страны</types>
    </type>
  </attributes>
  <attributes>
    <name>КорреспондентскийСчет</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АдресБанка</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТелефонБанка</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

src/DemoApp/src/Catalogs/Банки/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)

	Если ОбменДанными.Загрузка = Истина Тогда
		Возврат;
	КонецЕсли;

	Если ЗначениеЗаполнено(КорреспондентскийСчет) Тогда

		Если СтрДлина(КорреспондентскийСчет) <> 20 Тогда

			СообщениеПользователю = Новый СообщениеПользователю;
			СообщениеПользователю.Текст = "Корреспондентский счет должен содержать 20 цифр.";
			СообщениеПользователю.Сообщить();
			Отказ = Истина;
			Возврат;

		КонецЕсли;

		Для НомерСимвола = 1 По 20 Цикл

			СимволСчета = Сред(КорреспондентскийСчет, НомерСимвола, 1);

			Если СтрНайти("0123456789", СимволСчета) = 0 Тогда

				СообщениеПользователю = Новый СообщениеПользователю;
				СообщениеПользователю.Текст = "Корреспондентский счет должен содержать только цифры.";
				СообщениеПользователю.Сообщить();

				Отказ = Истина;
				Возврат;

			КонецЕсли;

		КонецЦикла;

	КонецЕсли;
	Если ЗначениеЗаполнено(БИК) Тогда

		Если СтрДлина(БИК) <> 9 Тогда

			СообщениеПользователю = Новый СообщениеПользователю;
			СообщениеПользователю.Текст = "БИК должен содержать 9 цифр.";
			СообщениеПользователю.Сообщить();
			
			Отказ = Истина;
			Возврат;

		КонецЕсли;

		Для НомерСимвола = 1 По 9 Цикл

			Если СтрНайти("0123456789", Сред(БИК, НомерСимвола, 1)) = 0 Тогда

				СообщениеПользователю = Новый СообщениеПользователю;
				СообщениеПользователю.Текст = "БИК должен содержать только цифры.";
				СообщениеПользователю.Сообщить();
				
				Отказ = Истина;
				Возврат;

			КонецЕсли;

		КонецЦикла;

	КонецЕсли;
	ТелефонБанка = НормализоватьТелефон(ТелефонБанка);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция НормализоватьТелефон(НомерТелефона)

	Результат = СокрЛП(НомерТелефона);

	Результат = СтрЗаменить(Результат, " ", "");
	Результат = СтрЗаменить(Результат, "-", "");
	Результат = СтрЗаменить(Результат, "(", "");
	Результат = СтрЗаменить(Результат, ")", "");

	Возврат Результат;

КонецФункции

#КонецОбласти

#КонецЕсли
